{
  "Bufferline": { "branch": "main" },
  "Catppuccin colorscheme": { "branch": "main" },
  "Comment": { "branch": "master" },
  "Kanagawa colorscheme": { "branch": "master" },
  "LuaSnip": { "branch": "master" },
  "Mason": { "branch": "main" },
  "Neotree": { "branch": "v3.x" },
  "Night Owl": { "branch": "main" },
  "Noice": { "branch": "main" },
  "Rose-pine colorscheme": { "branch": "main" },
  "Startify": { "branch": "master" },
  "Telescope": { "branch": "master" },
  "Todo-comments": { "branch": "main" },
  "ToggleTerm": { "branch": "main" },
  "TokyoNight colorscheme": { "branch": "main" },
  "Treesitter": { "branch": "master" },
  "Which-key": { "branch": "main" },
  "auto-hlsearch.nvim": { "branch": "main" },
  "autopairs": { "branch": "master" },
  "cmp-buffer": { "branch": "main" },
  "cmp-cmdline": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp_luasnip": { "branch": "master" },
  "gitsigns.nvim": { "branch": "main" },
  "indent-blankline.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lsp_signature.nvim": { "branch": "master" },
  "lspkind.nvim": { "branch": "master" },
  "lspsaga": { "branch": "main" },
  "lualine": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "neodev.nvim": { "branch": "main" },
  "none-ls.nvim": { "branch": "main" },
  "nui.nvim": { "branch": "main" },
  "nvim-cmp": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-notify": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "trouble.nvim": { "branch": "main" },
  "vim-surround": { "branch": "master" },
  "vim-tmux-navigator": { "branch": "master" },
  "vim-wakatime": { "branch": "master" },
  "zen-mode": { "branch": "main" }
}