{
  "Bufferline": { "branch": "main" },
  "Catppuccin colorscheme": { "branch": "main" },
  "Comment": { "branch": "master" },
  "Git signs": { "branch": "main" },
  "Kanagawa colorscheme": { "branch": "master" },
  "LuaSnip": { "branch": "master" },
  "Mason": { "branch": "main" },
  "Mason lspconfig": { "branch": "main" },
  "Neotree": { "branch": "v3.x" },
  "Night Owl colorscheme": { "branch": "main" },
  "Rose-pine colorscheme": { "branch": "main" },
  "Startify": { "branch": "master" },
  "Telescope": { "branch": "master" },
  "TokyoNight colorscheme": { "branch": "main" },
  "Treesitter": { "branch": "master" },
  "Treesitter textobjects": { "branch": "master" },
  "Trouble": { "branch": "main" },
  "Wakatime": { "branch": "master" },
  "Which-key": { "branch": "main" },
  "Zen Mode": { "branch": "main" },
  "autopairs": { "branch": "master" },
  "cmp-buffer": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp_luasnip": { "branch": "master" },
  "hlsearch": { "branch": "main" },
  "indent-blankline.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lspkind": { "branch": "master" },
  "lspsaga": { "branch": "main" },
  "lualine": { "branch": "master" },
  "neodev.nvim": { "branch": "main" },
  "none-ls.nvim": { "branch": "main" },
  "nui.nvim": { "branch": "main" },
  "nvim-cmp": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-ts-autotag": { "branch": "nvim_0.9" },
  "nvim-web-devicons": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "schemastore.nvim": { "branch": "main" },
  "vim-surround": { "branch": "master" },
  "vim-tmux-navigator": { "branch": "master" }
}
